{
  "Bot": {
    "cooldownInterval": 8000,
    "softCooldown": 5,
    "hardCooldown": 7
  },
  "Slack": {
    "botToken": "",
    "userToken": "",
    "clientID": ""
  },
  "Discord": {
    "token": "",
    "messageDelay": 300,
    "totalShards": 0,
    "shard": 0
  },
  "Database": {
    "client": "mysql",
    "connection": {
      "host": "localhost",
      "port": 3306,
      "user": "",
      "password": "",
      "database": "ocelotbot",
      "charset": "utf8mb4_general_ci"
    },
    "pool": {
      "min": 0,
      "max": 20
    }
  },
  "Broker": {
    "socket": "ocelotbot",
    "debug": true
  },
  "Sentry": {
  	"key": ""
  },
  "Commands": {
    "8ball": {
      "responses": [
        "It is certain",
        "It is decidedly so",
        "Without a doubt",
        "Yes, definitely",
        "You may rely on it",
        "As I see it, yes",
        "Most likely",
        "Outlook good",
        "Yes",
        "Signs point to yes",
        "Don't count on it",
        "My reply is no",
        "My sources say no",
        "Outlook not so good",
        "Very doubtful"
      ]
    },
    "crush": {
      "dir": "temp/",
      "filename": "crush.png",
      "template": "static/crush.png"
    },
    "image": {
      "userAgent": "OcelotBOT v4 by /u/UnacceptableUse"
    },
    "insult": {
      "insults": [
        "your mother was a hamster and your father smelt of elderberries,",
        "everyone just tolerates you.",
        "your parents never really loved you.",
        "you must've been born on a highway, that's where most accidents happen.",
        "your birth certificate is an apology from the condom factory.",
        "fuck you",
        "eat my ass",
        "suck my fucking dick bitch",
        "I'd rather hear gunshots coming from my parents' room than hear you speak again.",
        "it would be easier for me to count your brain cells than your rolls of fat.",
        "your mom has seen more black cock than a KFC urinal.",
        "you're like an insect. You're small, you're insignificant, you're worthless, you won't make a difference to my life, but goddamn do I want to get rid of you.",
        "you're the dollar menu version of your father",
        "you are impossible to underestimate.",
        "you are so lazy, you are going to marry a pregnant woman.",
        "why are you playing so hard to get when you're already hard to want",
        "you're a complete tool but not half as useful",
        "God ruined a perfectly good asshole when he put teeth in your mouth.",
        "I would unplug your life support to charge my phone",
        "I hope you outlive your children",
        "your skin is so oily that it's a fucking miracle America hasn't invaded you yet.",
        "there's no u in teem\n\n\n\nbut there is one in retaurd 😏💯💯💯💯💯👌👌👌👌👌",
        "you're like a bowling ball, you get picked up, fingered, thrown down the alley, and still come back for more.",
        "your dick belongs in your pants, not your personality.",
        "you were birthed out your mothers ass because her cunt was too busy",
        "i will fuck the entire first row at your funeral",
        "go back inside your mother's pussy",
        "may dog fuck your mother!",
        "your face makes me laugh",
        "I'd say you are cancer but at least cancer kills",
        "you're kinda like Rapunzel except instead of letting down your hair you let down everyone in your life",
        "I'm sorry your dad beat you instead of cancer",
        "you are dumber than a block of wood and not nearly as useful",
        "you are a pizza burn on the roof of the world's mouth.",
        "you disgust me",
        "every fibre of my being despises you.",
        "your mum should've swallowed.",
        "you're a real cunt, you know that?",
        "you make me sick",
        "you make me physically ill.",
        "I can't stand the sight of you",
        "why play so hard to get when you're so hard to want?",
        "you are one of those people who would be enormously improved by death.",
        "now I see why everyone talks about you behind your back.",
        "you suck dick for beer money and you don't even drink beer.",
        "you suck dick for bus fare, and then walk home.",
        "you look like a *before* picture.",
        "your gene pool needs a little chlorine",
        "if you were any more inbread you'd be a sandwich",
        "you're not pretty enough to be this stupid",
        "I'd challenge you to a battle of wits, but I see you're unarmed.",
        "I'm not saying you're fat, but you look like someone poured you into your clothes and you forgot to say when.",
        "what doesn't kill you...disappoints me.",
        "you couldn't pour water out of a boot if the instructions were on the sole.",
        "why are you even here?",
        "your mother is so old she has a separate entrance for black men.",
        "the best part of you ran down your mother's legs",
        "anyone who ever loved you was wrong.",
        "you're like the top piece of bread. Everybody touches you, but nobody wants you.",
        "you have enough extra chromosomes to make a friend.",
        "I'm not saying that you're a slut, but your spit would be accepted at a sperm bank.",
        "you are more useless than Anne Frank's drum set.",
        "I hope you out live your children you pathetic fuck. Difference between you and hitler is that Hitler knew when to kill himself. if i were to insult you it'd be animal abuse you make blind kids cry why don't you slip into something more comfortable... like a coma. two wrongs doesn't make a right, take your parents as an example. even sam pepper wouldn't grab your butt i hope you step on a puddle... with socks on. you're like the first slice of bread in the bag, everybody touches, you but nobody wants you is your family tree a straight line? you're as useless as gta's traffic lights minion lover you're more ignored than the terms and conditions you remind of a character in a disney movie, quasimodo. if your iq was as high as your weight you'd be a genuis if you kill yourself, the average iq in the world would go up by 20 you have something on your chin, no not that one, the third one down  Fuck you .... you ugly piece of shit turtle you motherfucking ugly cunt fucking shit",
        "i want to see your glance as i smash your skull into the fucking concrete, and i strangle the life out of you, pushing my thumbs into your eye sockets until you cry blood. Well... not before forcing you to watch your beloved ones die in front of you.",
        "I fingered your sister and found your dad's wedding ring.",
        "the only way you'll ever get laid is if you crawl up a chickens ass and wait.",
        "you homosexuality",
        "your mother prayed for a miscarriage.",
        "I will never get over the embarrassment of belonging to the same species as you. You are a monster, an ogre, a malformity. I wretch at the very thought of you. You have all the appeal of a paper cut. Lepers avoid you. You are vile, worthless, less than nothing. You are a weed, a fungus, and the dregs of this earth. And did I mention you smell? Monkeys look down on you. Even sheep won't have sex with you. You are unreservedly pathetic, starved for attention, and lost in a land that reality forgot. You are a waste of flesh. On a good day you're a halfwit. You are deficient in all that lends character. You have the personality of wallpaper. You are dank and filthy. You are asinine and benighted. You are the source of all unpleasantness. You spread misery and sorrow wherever you go.",
        "you are a fiend and a coward, and you have bad breath. You are degenerate, noxious and depraved. I feel debased just for knowing you exist. I despise everything about you, and I wish you would go away. I cannot believe how incredibly stupid you are. The only thing worse than your logic is your manners. Maybe later in life, after you have learned to read, write, study, spell, and count, you will have more success. True, these are rudimentary skills that many of us \"normal\" people take for granted that everyone has an easy time of mastering. It just wouldn't have been \"right\". Sort of like parking in a handicap space. I wish you the best of luck in the emotional, and social struggles that seem to be placing such a demand on you.",
        "I don't like you. I don't like anybody who has as little respect for others as you do. Go away, you swine. You're a putrescent mass, a walking vomit. You are a spineless little worm deserving nothing but the profoundest contempt. You are a jerk, a cad, and a weasel. Your life is a monument to stupidity. You are a stench, a revulsion, a big suck on a sour lemon. You are a curdled staggering mutant dwarf smeared richly with the effluvia and offal accompanying your alleged birth into this world. Meaningful to no one, abandoned by the puke-drooling, giggling beasts that sired you and then killed themselves in recognition of what they had done.",
        "you have nothing to say, and Godwin's Law does not apply when writing about you. You are the anti-Midas, for all that you touch becomes valueless and unusable. Mothers gather their children close when you appear. You are an aberration, a corruption, and a boil that needs to be lanced. You are a poison in need of being vomited. You are a tooth so rotten it infects the whole body. You are sperm that should have been captured in a condom and flushed down a toilet.",
        "you are wholly without any redeeming social grace or value. If God ever decides to give the planet an enema you'd better run like the wind because anywhere you stand is a suitable place for The Insertion. There is no animal so disgusting, so vile that it deserves comparison to you, for even the lowest, dirtiest, most parasitic member of the animal kingdom fills an ecological niche. You fill no niche. To call you a parasite would be injurious and defamatory to the thousands of honest parasitic species. You are worse than vermin, for vermin do not pretend to be what it is not. You are truly human garbage. You are a fraudulent, lying, predatory charlatan. You are of less worth than a burnt-out light bulb. You will forever live in shame.",
        "your personality is that of a rabid Chihuahua intent on destroying its own tail. Your powers of observation are akin to those of the bird that keeps slamming into the picture window trying to get that other bird it keeps seeing. You are walking, talking proof that you don't have to be sentient to survive, and that Barnum was thinking of you when he uttered his immortal phrase regarding the birth of a sucker. You are, at varying times, tedious, boring, and even occasionally earth shatteringly hilarious in your idiocy, routinely childish, moronic, pathetic, wretched, disgusting and pitiful.",
        "you're an idiot. A moron of the highest order. You're so stupid it's a wonder and a pity you can remember to breath. Intelligent ideas bounce off your head as if it were coated with teflon. Creative thoughts take alternate transportation in order to avoid even being in the same state as you. If you had an original thought it would die of loneliness before the hour was out. On an intelligence scale of 1 to 10 (10 corresponding to the highest attainable IQ) you're rating is so far into negative numbers that one would need to travel into another quantum reality in order to even catch a distant glimpse of it.",
        "you swine. You vulgar little maggot. You worthless bag of filth. I wager you couldn't empty a boot of excrement were the instructions on the heel. You are a canker. A sore that won't go away. I would rather kiss a lawyer than be seen with you. Try to edit your responses of unnecessary material before attempting to impress us with your insight. The evidence that you are a nincompoop will still be available to readers, but they will be able to access it more rapidly.",
        "you snail-skulled little rabbit. Would that a hawk pick you up, drive its beak into your brain, and upon finding it rancid set you loose to fly briefly before spattering the ocean rocks with the frothy pink shame of your ignoble blood. May you choke on the queasy, convulsing nausea of your own trite, foolish beliefs. You are weary, stale, flat and unprofitable. You are grimy, squalid, nasty and profane. You are foul and disgusting. You're a fool, an ignoramus.",
        "you... dirty... stuck-up... sadistic... shit-eating, cocksucking, buttfucking, penis-smelling, crotch-grabbing, ball-licking, semen-drinking, dog-raping, Nazi-loving, child-touching, cow-humping, perverted, spineless, heartless, mindless, dickless, testicle-choking, urine-gargling, jerk-offing, horse face, sheep-fondling, toilet-kissing, self-centered, feces-puking, dildo-shoving, snot-spitting, crap-gathering, big-nosed, monkey-slapping, bastard-screwing, bean-shitting, fart-knocking, sack-busting, splooge-tasting, bear-blowing, head-swallowing, bitch-snatching, handjobbing, donkey-caressing, mucus-spewing, anal-plugging, hoe-grabbing, uncircumcised, sewer-sipping, whore mongering, piss-swimming, midget-munching, douchebag, hole-biting, carnivorous, mail-order prostituting **asshole**!",
        "you stupid fucking bitch i might as well delete your comment right now but i'm not a fucking cuck stupid shithead. it's funny how you insult me for not being nice but then treat me like shit and expect me not to get mad. go die in a ditch you stupid piece of shit, don't even reply to this motherfucker. i don't give a fuck who you're friends with or who you are and in no way is this biased, go eat shit. i honestly don't give a single fuck lmao.",
        "whoever's willing to fuck you is just too lazy to jerk off.",
        "you're fat. And i'm not going to sugarcoat it because you'll eat that too",
        "you fight like a dairy farmer",
        "I heard your mum got into a skydiving accident: http://i.imgur.com/m7lT1Q1.jpg",
        "you're a pathetic, shallow pile of poorly hidden insecurities",
        "my wife had a miscarriage. So just like your dad, I'll never know if my child was a boy or a girl",
        "you should plant seeds in your keyboard so your tears will grow a garden.",
        "I wouldn't fuck you for practice",
        "your mother fucks for bricks, so she can build your sister a whore house",
        "you will never be the man your mother was!",
        "you have the sexual charisma of a toddler's wake.",
        "you're not being the person Mister Rogers believed you could be.",
        "you're nothing but trash. Actually, I take that back. At least trash used to be something useful",
        "you look like your mom didn't get the abortion quite right and just fucked up your face with the coat hanger.",
        "your makeup has more depth than your personality",
        "you look like you smell like cum.",
        "it looks like your face caught fire, and someone put it out with a fork.",
        "i bet your mother left you as a child and you had to survive alone sad and lonely when you grew up everyday you came home from work you cried in bed cuz you had no one until one day someone wanted to be your friend and you were happy. and then you came home from work one day and was like im go suicide bye, faggot",
        "to say you're surface level would be an insult to the ground floor."
      ]
    },
    "ipinfo": {
        "key": "",
        "days": 365,
        "reportCategories": {
          "3": "Fraud Orders",
          "4": "DDoS Attack",
          "9": "Open Proxy",
          "10": "Web Spam",
          "11": "Email Spam",
          "14": "Port Scan",
          "18": "Brute Force",
          "19": "Bad Web Bot",
          "20": "Exploited Host",
          "21": "Web App Attack",
          "22": "SSH",
          "23": "IoT Targeted"
        }
    },
    "peterstate": {
      "petifyKey": "",
      "petifyUser": "",
      "states": {
          "Unknown": ":interrobang: Unknown?",
          "Home": "🏚 Sat at home, on his own probably.",
          "Outside": ":walking: Outside, probably busy.",
          "College": ":school: At College, probably in an exam.",
          "Sleeping": ":zzz: Asleep. Shhh.",
          "Abbeys": ":ok_hand: :point_left: At Abbey's house. Probably boning.",
          "Work": ":office: At work. Probably busy."
      }
    },
    "serverinfo": {
      "gameColours": {
        "tf": "#9C5220",
        "garrysmod": "#1295F0"
      },
      "presets": {
        "anex": ["185.44.78.69", "27155"],
        "southpaw": ["185.44.78.69", "27155"],
        "nemesis": ["185.44.78.69", "27155"],
        "nemasis": ["185.44.78.69", "27155"],
        "nemisis": ["185.44.78.69", "27155"],
        "doublecross": ["193.111.142.33", "27021"]
      }
    },
    "status": {
      "hosts": [
        {
          "host": "earth.boywanders.us",
          "name": "Earth (Main Server)"
        },
        {
          "host": "saturn.boywanders.us",
          "name": "Saturn"
        },
        {
          "host": "mercury.boywanders.us",
          "name": "Mercury (Audio proxy)"
        },
        {
          "host": "homeof.unacceptableuse.com",
          "name": "Petermon (!peterstate)"
        }
      ]
    },
    "trivia": {
      "seconds": 15
    },
    "weather": {
      "key": ""
    },
    "sexysingle": {
      "template": "static/sexysingle-0.png",
      "filename": "SEXYSINGLES.png",
      "dir": "temp/"
    }
  },
  "Modules": {
    "LoadBefore": [
      "util",
      "database",
      "lang",
      "commands",
      "ipc",
      "autoreplies"
    ],
    "LoadAfter": [

    ]
  },
  "Receivers": [
    "discord"
  ],
  "Languages": {
    "default": "en-GB.json",
    "en": "en-GB.json",
    "en-GB": "en-GB.json",
    "en-US": "en-GB.json",
    "fi": "fi.json",
    "fr": "fr.json",
    "ar": "ar.json",
    "fil": "fil.json",
    "gr": "el.json",
    "el": "el.json"
  },
  "ConflictingBots": [
    "189702078958927872",
    "256530827842813962",
    "290225453354975232",
    "107256979105267712",
    "81026656365453312",
    "86920406476292096",
    "242728049131388930",
    "324356264983527424",
    "265161580201771010",
    "172002275412279296",
    "204777316621090816",
    "292953664492929025",
    "159985870458322944",
    "170903342199865344",
    "265299552834289664",
    "213868823151902721",
    "268420199370194944",
    "341035532546998282",
    "278647619780083712",
    "338897906524225538",
    "298492601756024835",
    "325290601077538828",
    "330168484216700939",
    "346704840673722382",
    "315235377503928321"
  ]
}